foxval/esp-idf/components/soc/esp32c/include/soc/rtc_io_struct.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_RTC_IO_STRUCT_H_
#define _SOC_RTC_IO_STRUCT_H_

#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    union {
        struct {
            uint32_t reserved0:        14;
            uint32_t data:             18;              /*RTC GPIO 0 ~ 17 output data*/
        };
        uint32_t val;
    } out;
    union {
        struct {
            uint32_t reserved0:             14;
            uint32_t w1ts:                  18;         /*RTC GPIO 0 ~ 17 output data write 1 to set*/
        };
        uint32_t val;
    } out_w1ts;
    union {
        struct {
            uint32_t reserved0:             14;
            uint32_t w1tc:                  18;         /*RTC GPIO 0 ~ 17 output data write 1 to clear*/
        };
        uint32_t val;
    } out_w1tc;
    union {
        struct {
            uint32_t reserved0:      14;
            uint32_t enable:         18;                /*RTC GPIO 0 ~ 17 enable*/
        };
        uint32_t val;
    } enable;
    union {
        struct {
            uint32_t reserved0:           14;
            uint32_t w1ts:                18;           /*RTC GPIO 0 ~ 17 enable write 1 to set*/
        };
        uint32_t val;
    } enable_w1ts;
    union {
        struct {
            uint32_t reserved0:           14;
            uint32_t w1tc:                18;           /*RTC GPIO 0 ~ 17 enable write 1 to clear*/
        };
        uint32_t val;
    } enable_w1tc;
    union {
        struct {
            uint32_t reserved0:          14;
            uint32_t status:             18;            /*RTC GPIO 0 ~ 17 interrupt status*/
        };
        uint32_t val;
    } status;
    union {
        struct {
            uint32_t reserved0:               14;
            uint32_t w1ts:                    18;       /*RTC GPIO 0 ~ 17 interrupt status write 1 to set*/
        };
        uint32_t val;
    } status_w1ts;
    union {
        struct {
            uint32_t reserved0:               14;
            uint32_t w1tc:                    18;       /*RTC GPIO 0 ~ 17 interrupt status write 1 to clear*/
        };
        uint32_t val;
    } status_w1tc;
    union {
        struct {
            uint32_t reserved0:       14;
            uint32_t in:              18;               /*RTC GPIO input data*/
        };
        uint32_t val;
    } in_val;
    union {
        struct {
            uint32_t reserved0:                   2;
            uint32_t pad_driver:                  1;    /*if set to 0: normal output  if set to 1: open drain*/
            uint32_t reserved3:                   4;
            uint32_t int_type:                    3;    /*if set to 0: GPIO interrupt disable   if set to 1: rising edge trigger   if set to 2: falling edge trigger  if set to 3: any edge trigger  if set to 4: low level trigger   if set to 5: high level trigger*/
            uint32_t wakeup_enable:               1;    /*RTC GPIO wakeup enable bit*/
            uint32_t reserved11:                 21;
        };
        uint32_t val;
    } pin[18];
    union {
        struct {
            uint32_t sel0:                    5;
            uint32_t sel1:                    5;
            uint32_t sel2:                    5;
            uint32_t sel3:                    5;
            uint32_t sel4:                    5;
            uint32_t no_gating_12m:           1;
            uint32_t reserved26:              6;
        };
        uint32_t val;
    } debug_sel;
    uint32_t dig_pad_hold;                              /*Digital pad hold. Bit0 – U0RXD  bit1 – U0TXD  bit2 – SD_CLK  bit3 – SD_DATA0  bit4 – SD_DATA1  bit5 – SD_DATA2  bit6 – SD_SATA3  bit7 – SD_CMD  bit8 – GPIO5  bit9 – GPIO16  bit10 – GPIO17  bit11 – GPIO18  bit12 – GPIO19  bit13 – GPIO20  bit14 – GPIO21  bit15 – GPIO22  bit16 – GPIO23.*/
    union {
        struct {
            uint32_t reserved0: 30;
            uint32_t hall_phase: 1;                     /*Reverse phase of hall sensor*/
            uint32_t xpd_hall:   1;                     /*Power on hall sensor and connect to VP and VN*/
        };
        uint32_t val;
    } hall_sens;
    union {
        struct {
            uint32_t reserved0:      4;
            uint32_t sense4_fun_ie:  1;                 /*input enable in work mode*/
            uint32_t sense4_slp_ie:  1;                 /*input enable in sleep mode*/
            uint32_t sense4_slp_sel: 1;                 /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t sense4_fun_sel: 2;                 /*SENSE4 function sel*/
            uint32_t sense3_fun_ie:  1;                 /*input enable in work mode*/
            uint32_t sense3_slp_ie:  1;                 /*input enable in sleep mode*/
            uint32_t sense3_slp_sel: 1;                 /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t sense3_fun_sel: 2;                 /*SENSE3 function sel*/
            uint32_t sense2_fun_ie:  1;                 /*input enable in work mode*/
            uint32_t sense2_slp_ie:  1;                 /*input enable in sleep mode*/
            uint32_t sense2_slp_sel: 1;                 /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t sense2_fun_sel: 2;                 /*SENSE2 function sel*/
            uint32_t sense1_fun_ie:  1;                 /*input enable in work mode*/
            uint32_t sense1_slp_ie:  1;                 /*input enable in sleep mode*/
            uint32_t sense1_slp_sel: 1;                 /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t sense1_fun_sel: 2;                 /*SENSE1 function sel*/
            uint32_t sense4_mux_sel: 1;                 /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t sense3_mux_sel: 1;                 /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t sense2_mux_sel: 1;                 /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t sense1_mux_sel: 1;                 /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t sense4_hold:    1;                 /*SENSE4 hold*/
            uint32_t sense3_hold:    1;                 /*SENSE3 hold*/
            uint32_t sense2_hold:    1;                 /*SENSE2 hold*/
            uint32_t sense1_hold:    1;                 /*SENSE1 hold*/
        };
        uint32_t val;
    } sensor_pads;
    union {
        struct {
            uint32_t reserved0:   10;
            uint32_t adc2_fun_ie:  1;                   /*input enable in work mode*/
            uint32_t adc2_slp_ie:  1;                   /*input enable in sleep mode*/
            uint32_t adc2_slp_sel: 1;                   /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t adc2_fun_sel: 2;                   /*ADC2 function sel*/
            uint32_t adc2_mux_sel: 1;                   /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t adc2_rue:     1;                   /*ADC2_RUE*/
            uint32_t adc2_rde:     1;                   /*ADC2_RDE*/
            uint32_t adc2_hold:    1;                   /*ADC2 hold*/
            uint32_t adc2_drv:     2;                   /*ADC2_DRV*/
            uint32_t adc1_fun_ie:  1;                   /*input enable in work mode*/
            uint32_t adc1_slp_ie:  1;                   /*input enable in sleep mode*/
            uint32_t adc1_slp_sel: 1;                   /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t adc1_fun_sel: 2;                   /*ADC1 function sel*/
            uint32_t adc1_mux_sel: 1;                   /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t adc1_rue:     1;                   /*ADC1_RUE*/
            uint32_t adc1_rde:     1;                   /*ADC1_RDE*/
            uint32_t adc1_hold:    1;                   /*ADC1 hold*/
            uint32_t adc1_drv:     2;                   /*ADC1_DRV*/
        };
        uint32_t val;
    } adc_pad;
    union {
        struct {
            uint32_t reserved0:          10;
            uint32_t dac_xpd_force:       1;            /*1: use reg_pdac1_xpd_dac to control PDAC1_XPD_DAC 0: use SAR ADC FSM to control PDAC1_XPD_DAC*/
            uint32_t fun_ie:              1;            /*input enable in work mode*/
            uint32_t slp_oe:              1;            /*output enable in sleep mode*/
            uint32_t slp_ie:              1;            /*input enable in sleep mode*/
            uint32_t slp_sel:             1;            /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t fun_sel:             2;            /*PDAC1 function sel*/
            uint32_t mux_sel:             1;            /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t xpd_dac:             1;            /*PDAC1_XPD_DAC*/
            uint32_t dac:                 8;            /*PDAC1_DAC*/
            uint32_t rue:                 1;            /*PDAC1_RUE*/
            uint32_t rde:                 1;            /*PDAC1_RDE*/
            uint32_t hold:                1;            /*PDAC1 hold*/
            uint32_t drv:                 2;            /*PDAC1_DRV*/
        };
        uint32_t val;
    } pad_dac[2];
    union {
        struct {
            uint32_t reserved0:    5;
            uint32_t x32p_fun_ie:  1;                   /*input enable in work mode*/
            uint32_t x32p_slp_oe:  1;                   /*output enable in sleep mode*/
            uint32_t x32p_slp_ie:  1;                   /*input enable in sleep mode*/
            uint32_t x32p_slp_sel: 1;                   /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t x32p_fun_sel: 2;                   /*X32P function sel*/
            uint32_t x32n_fun_ie:  1;                   /*input enable in work mode*/
            uint32_t x32n_slp_oe:  1;                   /*output enable in sleep mode*/
            uint32_t x32n_slp_ie:  1;                   /*input enable in sleep mode*/
            uint32_t x32n_slp_sel: 1;                   /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t x32n_fun_sel: 2;                   /*X32N function sel*/
            uint32_t x32p_mux_sel: 1;                   /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t x32n_mux_sel: 1;                   /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t reserved19:   3;
            uint32_t x32p_rue:     1;                   /*X32N RUE*/
            uint32_t x32p_rde:     1;                   /*X32N RDE*/
            uint32_t x32p_hold:    1;                   /*X32N hold*/
            uint32_t x32p_drv:     2;                   /*X32P_DRV*/
            uint32_t x32n_rue:     1;                   /*X32N_RUE*/
            uint32_t x32n_rde:     1;                   /*X32N_RDE*/
            uint32_t x32n_hold:    1;                   /*X32N hold*/
            uint32_t x32n_drv:     2;                   /*X32N_DRV*/
        };
        uint32_t val;
    } xtal_32k_pad;
    union {
        struct {
            uint32_t reserved0:     23;
            uint32_t dcur:           2;                 /*TOUCH_DCUR*/
            uint32_t drange:         2;                 /*TOUCH_DRANGE*/
            uint32_t drefl:          2;                 /*TOUCH_DREFL*/
            uint32_t drefh:          2;                 /*TOUCH_DREFH*/
            uint32_t xpd_bias:       1;                 /*TOUCH_XPD_BIAS*/
        };
        uint32_t val;
    } touch_cfg;
    union {
        struct {
            uint32_t reserved0:         12;
            uint32_t to_gpio:            1;
            uint32_t fun_ie:             1;             /*input enable in work mode*/
            uint32_t slp_oe:             1;             /*output enable in sleep mode*/
            uint32_t slp_ie:             1;             /*input enable in sleep mode*/
            uint32_t slp_sel:            1;             /*1: enable sleep mode during sleep 0: no sleep mode*/
            uint32_t fun_sel:            2;             /*function sel*/
            uint32_t mux_sel:            1;             /*1: use RTC GPIO 0: use digital GPIO*/
            uint32_t xpd:                1;             /*TOUCH_XPD*/
            uint32_t tie_opt:            1;             /*TOUCH_TIE_OPT*/
            uint32_t start:              1;             /*TOUCH_START*/
            uint32_t dac:                3;             /*TOUCH_DAC*/
            uint32_t reserved26:         1;
            uint32_t rue:                1;             /*RUE*/
            uint32_t rde:                1;             /*RDE*/
            uint32_t drv:                2;             /*DRV*/
            uint32_t hold:               1;             /*hold*/
        };
        uint32_t val;
    } touch_pad[10];
    union {
        struct {
            uint32_t reserved0:      27;
            uint32_t sel:             5;
        };
        uint32_t val;
    } ext_wakeup0;
    union {
        struct {
            uint32_t reserved0:      27;
            uint32_t sel:             5;                /*select RTC GPIO 0 ~ 17 to control XTAL*/
        };
        uint32_t val;
    } xtl_ext_ctr;
    union {
        struct {
            uint32_t reserved0:        23;
            uint32_t debug_bit_sel:     5;
            uint32_t scl_sel:           2;
            uint32_t sda_sel:           2;
        };
        uint32_t val;
    } sar_i2c_io;
    union {
        struct {
            uint32_t date:      28;
            uint32_t reserved28: 4;
        };
        uint32_t val;
    } date;
} rtc_io_dev_t;
extern rtc_io_dev_t RTCIO;
#ifdef __cplusplus
}
#endif

#endif  /* _SOC_RTC_IO_STRUCT_H_ */
